software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/UpdateSpecimen.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <UpdateRequest xmlns="http://wapi.wustl.edu/WAPI">
            <object>
                <ns1:AbstractDomainObject
                        activityStatus="Active"
                        availableQuantity="0.0"
                        barcode="Bar Code AAA - 200"
                        collectionStatus="Pending"
                        identifier="3824"
                        initialQuantity="10.0"
                        isAvailable="true"
                        label="Label AAA - 200"
                        pathologicalStatus="Not Specified"
                        specimenClass="Fluid"
                        specimenType="Serum"
			            lineage="New"
                        xsi:type="ns2:FluidSpecimen"
                        xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws"
                        xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">

<!--		<ns2:parentSpecimen>
                        <ns2:AbstractSpecimen
                                availableQuantity="0.0"
                                identifier="3824"
                                initialQuantity="0.0"
                                isAvailable="false"
                                label="Label AAA - 200" xsi:type="ns2:TissueSpecimen"/>
                    </ns2:parentSpecimen>
-->
                    <ns2:specimenCharacteristics>
                        <ns2:SpecimenCharacteristics identifier="1" tissueSide="Left" tissueSite="Not Specified"/>
                    </ns2:specimenCharacteristics>

                    <ns2:specimenCollectionGroup>
                        <ns2:SpecimenCollectionGroup identifier="1"/>
                    </ns2:specimenCollectionGroup>

                </ns1:AbstractDomainObject>
            </object>
        </UpdateRequest>
    </soapenv:Body>
</soapenv:Envelope>